
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>序言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter1/" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Rust实践之路
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter1/">
            
                <a href="chapter1/">
            
                    
                    第1章 Rust工具链安装和介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter1/1.1-Rust工具链安装原理.html">
            
                <a href="chapter1/1.1-Rust工具链安装原理.html">
            
                    
                    1.1 Rust工具链安装原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapter1/1.2-MSbuildtool的安装.html">
            
                <a href="chapter1/1.2-MSbuildtool的安装.html">
            
                    
                    1.2 MS build tool的安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="chapter1/1.3-Rustup下载及安装.html">
            
                <a href="chapter1/1.3-Rustup下载及安装.html">
            
                    
                    1.3 Rustup下载及安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="chapter1/1.4-Rust安装过程的知识点.html">
            
                <a href="chapter1/1.4-Rust安装过程的知识点.html">
            
                    
                    1.4 Rust安装过程的知识点
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="chapter1/1.5-Rustup管理多工具链的方法.html">
            
                <a href="chapter1/1.5-Rustup管理多工具链的方法.html">
            
                    
                    1.5 Rustup管理多工具链的方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="chapter1/1.6-Cargo管理项目的方法.html">
            
                <a href="chapter1/1.6-Cargo管理项目的方法.html">
            
                    
                    1.6 Cargo管理项目的方法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter2/">
            
                <a href="chapter2/">
            
                    
                    第2章 Rust基础知识
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="chapter2/2.1-变量和可变性.html">
            
                <a href="chapter2/2.1-变量和可变性.html">
            
                    
                    2.1 变量和可变性
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >序言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5E8F;&#x8A00;">&#x5E8F;&#x8A00;</h1>
<h2 id="&#x672C;&#x4E66;&#x7F18;&#x8D77;">&#x672C;&#x4E66;&#x7F18;&#x8D77;</h2>
<p>Rust&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4F5C;&#x4E3A;&#x4E00;&#x95E8;&#x65B0;&#x5174;&#x7684;&#x7CFB;&#x7EDF;&#x7EA7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x4FDD;&#x8BC1;&#x5185;&#x5B58;&#x5B89;&#x5168;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x8FD8;&#x5177;&#x5907;&#x4E86;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#xFF0C;&#x5B83;&#x662F;&#x7406;&#x60F3;&#x7684;&#x66FF;&#x4EE3;C&#x3001;C++&#x8BED;&#x8A00;&#x6784;&#x7B51;&#x7684;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#x751F;&#x6001;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;Rust&#x5728;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#x9886;&#x57DF;&#x4E5F;&#x5DF2;&#x7ECF;&#x53D6;&#x5F97;&#x4E86;&#x5404;&#x65B9;&#x9762;&#x7684;&#x5E7F;&#x6CDB;&#x8BA4;&#x53EF;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x8BA4;&#x53EF;&#x662F;Linux&#x5185;&#x6838;&#x5F00;&#x59CB;&#x652F;&#x6301;&#x7528;Rust&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x5916;&#x8BBE;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>Rust&#x8BED;&#x8A00;&#x7684;&#x672A;&#x6765;&#x4E0D;&#x53EF;&#x9650;&#x91CF;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x670B;&#x53CB;&#x4EEC;&#x4E5F;&#x5BF9;Rust&#x62A5;&#x6709;&#x6781;&#x5927;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x5E94;&#x7528;&#x70ED;&#x60C5;&#xFF0C;&#x5F88;&#x591A;&#x5DE5;&#x7A0B;&#x5E08;&#x975E;&#x5E38;&#x671F;&#x5F85;&#x4F7F;&#x7528;Rust&#x8BED;&#x8A00;&#x91CD;&#x6784;&#x81EA;&#x5DF1;&#x7684;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#xFF0C;&#x6709;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5E0C;&#x671B;&#x5B66;&#x4E60;Rust&#x8BED;&#x8A00;&#x8FDB;&#x5165;Web3&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x7684;&#x505A;&#x673A;&#x5668;&#x4EBA;&#x5F00;&#x53D1;&#x3001;&#x65E0;&#x4EBA;&#x673A;&#x7B49;&#x786C;&#x6838;&#x65B0;&#x5174;&#x5236;&#x9020;&#x4E1A;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x5E0C;&#x671B;&#x4F7F;&#x7528;rust&#x6765;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x7684;&#x8F6F;&#x4EF6;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x4EE4;&#x4EBA;&#x5934;&#x75BC;&#x7684;C&#x548C;C++&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3001;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x7B49;&#x9EBB;&#x70E6;&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x7F8E;&#x56FD;&#x7684;&#x56FD;&#x9632;&#x90E8;&#x4E3A;&#x4E86;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x8F6F;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x4EEC;&#x653E;&#x5F03;C/C++&#x8BED;&#x8A00;&#xFF0C;&#x8F6C;&#x5411;Rust&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x589E;&#x52A0;&#x81EA;&#x8EAB;&#x7684;&#x8F6F;&#x4EF6;&#x5B89;&#x5168;&#xFF0C;&#x51CF;&#x5C11;&#x4FE1;&#x606F;&#x4E0A;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x51CF;&#x5C11;&#x654C;&#x7279;&#x4EEC;&#x523A;&#x63A2;&#x60C5;&#x62A5;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x90FD;&#x662F;Rust&#x53D1;&#x5C55;&#x5448;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x52BF;&#x5934;&#x548C;&#x8D8B;&#x52BF;&#xFF0C;&#x662F;&#x4EE4;&#x4EBA;&#x5341;&#x5206;&#x632F;&#x594B;&#x548C;&#x6B23;&#x559C;&#x7684;&#x3002;</p>
<p>&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5B66;&#x4E60;&#x70ED;&#x60C5;&#x9700;&#x8981;&#x843D;&#x5730;&#x5728;&#x5B66;&#x4E60;&#x5B9E;&#x8DF5;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x76EE;&#x524D;&#x5B66;&#x4E60;Rust&#x8BED;&#x8A00;&#x65F6;&#x5927;&#x5BB6;&#x7F3A;&#x4E4F;&#x6709;&#x6548;&#x7B80;&#x6D01;&#x7684;Rust&#x6559;&#x6750;&#xFF0C;&#x8FD9;&#x963B;&#x788D;&#x4E86;&#x5927;&#x5BB6;&#x524D;&#x8FDB;&#x7684;&#x6B65;&#x4F10;&#x3002;&#x6709;&#x611F;&#x4E8E;&#x6B64;&#x79CD;&#x73B0;&#x72B6;&#xFF0C;&#x672C;&#x7740;&#x4E3A;&#x8F6F;&#x4EF6;&#x4E8B;&#x4E1A;&#x53D1;&#x5C55;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x5FAE;&#x8584;&#x529B;&#x91CF;&#x7684;&#x826F;&#x597D;&#x613F;&#x671B;&#xFF0C;&#x7279;&#x64B0;&#x5199;&#x6B64;&#x4E66;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x529B;&#x6C42;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x5C3D;&#x91CF;&#x5728;&#x7B26;&#x5408;&#x5927;&#x5BB6;&#x5DF2;&#x6709;&#x7684;&#x5BF9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x8BA4;&#x8BC6;&#x57FA;&#x7840;&#x4E0A;&#x53BB;&#x4ECB;&#x7ECD;Rust&#x8BED;&#x8A00;&#x7684;&#x63D0;&#x4F9B;&#x7684;&#x5404;&#x79CD;&#x529F;&#x80FD;&#xFF0C;&#x4E0D;&#x4F1A;&#x751F;&#x786C;&#x5730;&#x7ED9;&#x5927;&#x5BB6;&#x585E;Rust&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x53CD;&#x5E38;&#x8BC6;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4E00;&#x5B9A;&#x662F;&#x91C7;&#x7528;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#x7684;&#x65B9;&#x5F0F;&#x4ECB;&#x7ECD;Rust&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x540E;&#x9762;&#x90FD;&#x8BBE;&#x7F6E;&#x4E86;&#x5BF9;&#x5E94;&#x7684;&#x7EC3;&#x4E60;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC3;&#x4E60;&#x9898;&#x8BBE;&#x8BA1;&#x5408;&#x7406;&#x3001;&#x96BE;&#x5EA6;&#x9012;&#x8FDB;&#xFF0C;&#x5206;&#x4E3A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5DE9;&#x56FA;&#x9898;&#x3001;&#x7EFC;&#x5408;&#x63D0;&#x9AD8;&#x5B9E;&#x8DF5;&#x9898;&#x4E24;&#x4E2A;&#x7EA7;&#x522B;&#x3002;&#x76F8;&#x4FE1;&#x5728;&#x77E5;&#x8BC6;&#x70B9;&#x8BB2;&#x89E3;&#x3001;&#x7EC3;&#x4E60;&#x9898;&#x7EC3;&#x4E60;&#x540E;&#xFF0C;&#x5927;&#x5BB6;&#x4F1A;&#x5BF9;rust&#x6709;&#x5F7B;&#x5E95;&#x800C;&#x660E;&#x4E86;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x5927;&#x5BB6;&#x4F7F;&#x7528;Rust&#x89E3;&#x51B3;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x8F6F;&#x4EF6;&#x95EE;&#x9898;&#x6253;&#x4E0B;&#x575A;&#x5B9E;&#x7684;&#x77E5;&#x8BC6;&#x57FA;&#x7840;&#x3002;</p>
<h2 id="&#x5185;&#x5BB9;&#x7EC4;&#x7EC7;">&#x5185;&#x5BB9;&#x7EC4;&#x7EC7;</h2>
<p>&#x672C;&#x4E66;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x5206;&#x4E3A;&#x73AF;&#x5883;&#x51C6;&#x5907;&#x3001;&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x8BB2;&#x89E3;&#x3001;&#x7EFC;&#x5408;&#x77E5;&#x8BC6;&#x8BB2;&#x89E3;&#x7B49;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x73AF;&#x5883;&#x51C6;&#x5907;&#x90E8;&#x5206;&#xFF0C;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E86;Rust&#x8BED;&#x8A00;&#x7684;&#x5B89;&#x88C5;&#x3001;&#x914D;&#x7F6E;&#x7B49;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#xFF0C;&#x7136;&#x540E;&#x4ECB;&#x7ECD;Rustup&#x7BA1;&#x7406;&#x591A;&#x7248;&#x672C;&#x7684;Rust&#x5DE5;&#x5177;&#x94FE;&#xFF0C;&#x6700;&#x540E;&#x4ECB;&#x7ECD;&#x4E86;Cargo&#x7BA1;&#x7406;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x77E5;&#x8BC6;&#x70B9;&#x3002;</p>
<p>&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x662F;&#x5168;&#x4E66;&#x4E3B;&#x9898;&#xFF0C;&#x5168;&#x9762;&#x9610;&#x8FF0;Rust&#x8BED;&#x8A00;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x53D8;&#x91CF;&#x3001;&#x53EF;&#x53D8;&#x6027;&#x3001;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x8FD0;&#x7B97;&#x7B26;&#x3001;&#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x8BED;&#x53E5;&#x3001;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x7B49;&#x65B9;&#x9762;&#x4E00;&#x6B21;&#x5C55;&#x5F00;&#xFF0C;&#x8BB2;&#x89E3;&#x7684;&#x903B;&#x8F91;&#x987A;&#x5E8F;&#x5C3D;&#x91CF;&#x7B26;&#x5408;&#x5927;&#x5BB6;&#x5BF9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x60EF;&#x6709;&#x8BA4;&#x8BC6;&#xFF0C;&#x672C;&#x7740;&#x7528;&#x5DF2;&#x6709;&#x77E5;&#x8BC6;&#x53BB;&#x7406;&#x89E3;&#x672A;&#x77E5;&#x77E5;&#x8BC6;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x9010;&#x6E10;&#x4E60;&#x5F97;Rust&#x8BED;&#x8A00;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7F16;&#x7EC7;&#x8D77;Rust&#x8BED;&#x8A00;&#x7684;&#x77E5;&#x8BC6;&#x7F51;&#x3002;</p>
<p>&#x7EFC;&#x5408;&#x77E5;&#x8BC6;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x8BB2;crates&#x3001;mod&#x7B49;&#x4E0E;&#x7EC4;&#x7EC7;&#x4E00;&#x4E2A;&#x5927;&#x9879;&#x76EE;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<h2 id="&#x4E66;&#x7C4D;&#x7279;&#x8272;">&#x4E66;&#x7C4D;&#x7279;&#x8272;</h2>
<p>&#x672C;&#x4E66;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x7A81;&#x51FA;&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#xFF0C;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x3002;&#x672C;&#x4E66;&#x529B;&#x6C42;&#x7528;&#x5DF2;&#x6709;&#x77E5;&#x8BC6;&#x53BB;&#x7406;&#x89E3;&#x548C;&#x83B7;&#x53D6;&#x672A;&#x77E5;&#x77E5;&#x8BC6;&#xFF0C;&#x540C;&#x65F6;&#x529B;&#x6C42;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x8BB2;&#x7A76;&#x4E25;&#x683C;&#x7684;&#x903B;&#x8F91;&#x6E05;&#x6670;&#xFF0C;&#x4E0D;&#x751F;&#x786C;&#x585E;&#x6982;&#x5FF5;&#x7ED9;&#x8BFB;&#x8005;&#x3002;</li>
<li>&#x77E5;&#x8BC6;&#x70B9;&#x8986;&#x76D6;&#x5168;&#x9762;&#x3002;&#x672C;&#x4E66;&#x529B;&#x56FE;&#x5C06;Rust&#x8BED;&#x8A00;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x90FD;&#x6E05;&#x6670;&#x9610;&#x8FF0;&#xFF0C;&#x4E3A;&#x8BFB;&#x8005;&#x5728;&#x5B66;&#x4E60;&#x540E;&#x8FDB;&#x5165;&#x5B9E;&#x9645;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6253;&#x4E0B;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;</li>
<li>&#x77E5;&#x8BC6;&#x70B9;&#x8BB2;&#x89E3;&#x548C;&#x9488;&#x5BF9;&#x6027;&#x4E60;&#x9898;&#x5E76;&#x91CD;&#x3002;&#x5728;&#x8BB2;&#x89E3;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x540C;&#x6B65;&#x63A8;&#x51FA;&#x7EC3;&#x4E60;&#x9898;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x5728;&#x5B66;&#x4E60;&#x5230;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x540E;&#xFF0C;&#x9A6C;&#x4E0A;&#x5E94;&#x7528;&#x77E5;&#x8BC6;&#x70B9;&#x53BB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x68C0;&#x6D4B;&#x81EA;&#x5DF1;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#x7A0B;&#x5EA6;&#x3001;&#x52A0;&#x6DF1;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#x7A0B;&#x5EA6;&#x3002;&#x901A;&#x8FC7;&#x77E5;&#x8BC6;&#x70B9;&#x8BB2;&#x89E3;&#x3001;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5DE9;&#x56FA;&#x9898;&#x3001;&#x7EFC;&#x5408;&#x63D0;&#x9AD8;&#x5B9E;&#x8DF5;&#x9898;&#x9524;&#x70BC;&#xFF0C;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x8DF5;&#x5E76;&#x91CD;&#x4E24;&#x73AF;&#x8282;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x5F7B;&#x5E95;&#x638C;&#x63E1;&#x5229;&#x7528;Rust&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x7684;&#x80FD;&#x529B;&#x3002;</li>
</ul>
<h2 id="&#x9002;&#x8BFB;&#x4EBA;&#x7FA4;">&#x9002;&#x8BFB;&#x4EBA;&#x7FA4;</h2>
<p>&#x672C;&#x4E66;&#x9002;&#x5408;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x57FA;&#x7840;&#xFF0C;&#x6BD4;&#x5982;C&#x8BED;&#x8A00;&#x3001;C++&#x8BED;&#x8A00;&#x3001;Python&#x8BED;&#x8A00;&#x3001;Java&#x8BED;&#x8A00;&#x3001;C#&#x8BED;&#x8A00;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x8981;&#x638C;&#x63E1;Rust&#x8BED;&#x8A00;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x7FA4;&#x9605;&#x8BFB;&#xFF0C;&#x6BD4;&#x5982;&#x5927;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x9886;&#x57DF;&#x3001;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x3001;&#x822A;&#x7A7A;&#x822A;&#x5929;&#x3001;&#x6B66;&#x5668;&#x7814;&#x5236;&#x3001;&#x533B;&#x7597;&#x5668;&#x68B0;&#x7814;&#x5236;&#x3001;&#x5DE5;&#x7A0B;&#x673A;&#x68B0;&#x7814;&#x5236;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x82AF;&#x7247;&#x7814;&#x5236;&#x3001;&#x624B;&#x673A;&#x7814;&#x53D1;&#x7B49;&#x9886;&#x57DF;&#x5DE5;&#x4F5C;&#x7684;&#x7814;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E0D;&#x9002;&#x5408;&#x6CA1;&#x6709;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x80CC;&#x666F;&#x7684;&#x4EBA;&#x9605;&#x8BFB;&#xFF0C;&#x56E0;&#x4E3A;Rust&#x8BED;&#x8A00;&#x7684;&#x77E5;&#x8BC6;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x6709;&#x4E00;&#x5B9A;&#x96BE;&#x5EA6;&#xFF0C;&#x5BF9;&#x6CA1;&#x6709;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x70B9;&#x8D39;&#x52B2;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x4E0D;&#x6015;&#x79D1;&#x5B66;&#x4E0A;&#x96BE;&#x9898;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Rust实践之路">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter1/" class="navigation navigation-next " aria-label="Next page: 第1章 Rust工具链安装和介绍">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"序言","level":"1.2","depth":1,"next":{"title":"第1章 Rust工具链安装和介绍","level":"1.3","depth":1,"path":"chapter1/README.md","ref":"chapter1/README.md","articles":[{"title":"1.1 Rust工具链安装原理","level":"1.3.1","depth":2,"path":"chapter1/1.1-Rust工具链安装原理.md","ref":"chapter1/1.1-Rust工具链安装原理.md","articles":[]},{"title":"1.2 MS build tool的安装","level":"1.3.2","depth":2,"path":"chapter1/1.2-MSbuildtool的安装.md","ref":"chapter1/1.2-MSbuildtool的安装.md","articles":[]},{"title":"1.3 Rustup下载及安装","level":"1.3.3","depth":2,"path":"chapter1/1.3-Rustup下载及安装.md","ref":"chapter1/1.3-Rustup下载及安装.md","articles":[]},{"title":"1.4 Rust安装过程的知识点","level":"1.3.4","depth":2,"path":"chapter1/1.4-Rust安装过程的知识点.md","ref":"chapter1/1.4-Rust安装过程的知识点.md","articles":[]},{"title":"1.5 Rustup管理多工具链的方法","level":"1.3.5","depth":2,"path":"chapter1/1.5-Rustup管理多工具链的方法.md","ref":"chapter1/1.5-Rustup管理多工具链的方法.md","articles":[]},{"title":"1.6 Cargo管理项目的方法","level":"1.3.6","depth":2,"path":"chapter1/1.6-Cargo管理项目的方法.md","ref":"chapter1/1.6-Cargo管理项目的方法.md","articles":[]}]},"previous":{"title":"Rust实践之路","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false,"defaultTheme":"dark"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"}},"file":{"path":"preface.md","mtime":"2025-06-23T06:20:23.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-06-24T02:31:12.605Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

